DerickJavier/Derick_Thevene_Micro_2026_C2/TAREA 3/mqtt5_esp_idf/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000
